%%
%HCF1100 3D姿态展示计算算法
clear
figure
%%
%PA1=HCF1100_Euler(-19.8046,5.0638,331.1242)   %调用回调函数，返回其端点坐标值
%PA2=HCF1100_Euler(-16.4375,-11.7369,27.8834)   %调用回调函数，返回其端点坐标值

% PA1=HCF1100_Euler(8.3772,26.8269,195.6302)   %调用回调函数，返回其端点坐标值
% PA2=HCF1100_Euler(27.6364,0.1981,155.9685)   %调用回调函数，返回其端点坐标值

 PA1=HCF1100_Euler(-6.402007,-14.182192,312.832245)   %调用回调函数，返回其端点坐标值
 PA2=HCF1100_Euler(-23.484175,-13.727129,258.604736)   %调用回调函数，返回其端点坐标值
 PA3=HCF1100_Euler(-30.271954,-18.567686,180.831055)   %调用回调函数，返回其端点坐标值


%%
%计算2段设备共计3个端点的坐标
x4=0;y4=0;z4=0;

x3=PA3(1,1);
y3=PA3(2,1);
z3=PA3(3,1);

x2=PA2(1,1)+x3;
y2=PA2(2,1)+y3;
z2=PA2(3,1)+z3;

x1=PA1(1,1)+x2;
y1=PA1(2,1)+y2;
z1=PA1(3,1)+z2;

X=[x4,x3,x2,x1];
Y=[y4,y3,y2,y1];
Z=[z4,z3,z2,z1];
%%
%寻找XY向绝对值最大的数，XY向坐标尺自适应
% XY=[x1,x2,x3,y1,y2,y3];
% XYmin=min(XY);XYmax=max(XY);
% if((XYmin+XYmax)<0)
%     XYmax=-XYmin;
% end 
% if(XYmax<50) 
%     XYmax=50;
% end

%%
%3D 绘图
grid on;
hold on;
plot3(X,Y,Z,'-*');
set(gca,'Xlim',[-150,150]);
set(gca,'Ylim',[-150,150]);
set(gca,'Zlim',[0,150]);
xlabel('X轴');
ylabel('Y轴');
zlabel('Z轴');